Rishvi/Files/Format/CreateShipment.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cis="http://dhl.de/webservice/cisbase" xmlns:bus="http://dhl.de/webservices/businesscustomershipping">
   <soapenv:Header>
      <cis:Authentification>
            <cis:user>{{user}}</cis:user>
            <cis:signature>{{pass}}</cis:signature>
      </cis:Authentification>
   </soapenv:Header>
   <soapenv:Body>
      <bus:CreateShipmentOrderRequest>
         <bus:Version>
            <majorRelease>2</majorRelease>
            <minorRelease>0</minorRelease>
         </bus:Version>
         <ShipmentOrder>
            <sequenceNumber>01</sequenceNumber>
            <Shipment>
               <ShipmentDetails>
                  <product>{{product}}</product>
                  <cis:accountNumber>{{accountNumber}}</cis:accountNumber>
                  <shipmentDate>{{shipmentDate}}</shipmentDate>
                  <returnShipmentReference>{{returnShipmentReference}}</returnShipmentReference>
                  <ShipmentItem>
                     <weightInKG></weightInKG>
                     <lengthInCM></lengthInCM>
                     <widthInCM></widthInCM>
                     <heightInCM></heightInCM>
                  </ShipmentItem>
                  <Service>
                     <VisualCheckOfAge active="1" type="A16"/>
                     <PreferredLocation active="0" details="?"/>
                     <PreferredNeighbour active="0" details="?"/>
                     <GoGreen active="0"/>
                     <Personally active="0"/>
                     <CashOnDelivery active="0" codAmount="0"/>
                     <AdditionalInsurance active="0" insuranceAmount="0"/>
                     <BulkyGoods active="0"/>
                  </Service>
                  <Notification>
                     <recipientEmailAddress>{{recipientEmailAddress}}</recipientEmailAddress>
                  </Notification>
                  <BankData>
                     <cis:accountOwner></cis:accountOwner>
                     <cis:bankName></cis:bankName>
                     <cis:iban></cis:iban>
                     <cis:note1></cis:note1>
                     <cis:note2></cis:note2>                     
                     <cis:bic></cis:bic>
                     <cis:accountreference></cis:accountreference>
                  </BankData>
               </ShipmentDetails>
               <Shipper>
                  <Name>
                     <cis:name1>{{sname1}}</cis:name1>
                     <cis:name2/>
                     <cis:name3/>
                  </Name>
                  <Address>
                     <cis:streetName>{{sstreetName}}</cis:streetName>
                     <cis:streetNumber>{{sstreetNumber}}</cis:streetNumber>
                     <cis:addressAddition>{{saddressAddition}}</cis:addressAddition>
                     <cis:dispatchingInformation>{{sdispatchingInformation}}</cis:dispatchingInformation>
                     <cis:zip>{{szip}}</cis:zip>
                     <cis:city>{{scity}}</cis:city>                     
                     <cis:Origin>
                        <cis:country>{{scountry}}</cis:country>
                        <cis:countryISOCode>{{scountryISOCode}}</cis:countryISOCode>
                        <cis:state>{{sstate}}</cis:state>
                     </cis:Origin>
                  </Address>
                  <Communication>
                     <cis:phone/>
                     <cis:email/>
                     <cis:contactPerson/>
                  </Communication>
               </Shipper>
               <Receiver>
                  <cis:name1>{{rname1}}</cis:name1>
                  <Address>
                     <cis:name2/>
                     <cis:name3/>
                     <cis:streetName>{{rstreetName}}</cis:streetName>
                     <cis:streetNumber>{{rstreetNumber}}</cis:streetNumber>
                     <cis:addressAddition>{{raddressAddition}}</cis:addressAddition>
                     <cis:dispatchingInformation>{{rdispatchingInformation}}</cis:dispatchingInformation>
                     <cis:zip>{{rzip}}</cis:zip>
                     <cis:city>{{rcity}}</cis:city>
                     <cis:Origin>
                        <cis:country>{{rcountry}}</cis:country>
                        <cis:countryISOCode>{{rcountryISOCode}}</cis:countryISOCode>
                        <cis:state>{{rstate}}</cis:state>
                     </cis:Origin>
                  </Address>
                  <Communication>
                     <cis:phone/>
                     <cis:email/>
                     <cis:contactPerson/>
                  </Communication>
               </Receiver>
               <ReturnReceiver>
                  <Name>
                     <cis:name1>{{rname1}}</cis:name1>
                     <cis:name2/>
                     <cis:name3/>
                  </Name>
                  <Address>
                     <cis:streetName>{{rstreetName}}</cis:streetName>
                     <cis:streetNumber>{{rstreetNumber}}</cis:streetNumber>
                     <cis:addressAddition>{{raddressAddition}}</cis:addressAddition>
                     <cis:dispatchingInformation>{{rdispatchingInformation}}</cis:dispatchingInformation>
                     <cis:zip>{{rzip}}</cis:zip>
                     <cis:city>{{rcity}}</cis:city>
                     <cis:Origin>
                        <cis:country>{{rcountry}}</cis:country>
                        <cis:countryISOCode>{{rcountryISOCode}}</cis:countryISOCode>
                        <cis:state>{{rstate}}</cis:state>
                     </cis:Origin>
                  </Address>
                  <Communication>                     
                     <cis:phone/>                     
                     <cis:email/>
                     <cis:contactPerson/>
                  </Communication>
               </ReturnReceiver>
            </Shipment>
            <PrintOnlyIfCodeable active="1"/>
            <labelResponseType>URL</labelResponseType>
         </ShipmentOrder>
      </bus:CreateShipmentOrderRequest>
   </soapenv:Body>
</soapenv:Envelope>